a = """Октябрь уж наступил — уж роща отряхает
Последние листы с нагих своих ветвей;
Дохнул осенний хлад — дорога промерзает.
Журча еще бежит за мельницу ручей,
Но пруд уже застыл; сосед мой поспешает
В отъезжие поля с охотою своей,
И страждут озими от бешеной забавы,
И будит лай собак уснувшие дубравы.

Теперь моя пора: я не люблю весны;
Скучна мне оттепель; вонь, грязь — весной я болен;
Кровь бродит; чувства, ум тоскою стеснены.
Суровою зимой я более доволен,
Люблю ее снега; в присутствии луны
Как легкий бег саней с подругой быстр и волен,
Когда под соболем, согрета и свежа,
Она вам руку жмет, пылая и дрожа!

Как весело, обув железом острым ноги,
Скользить по зеркалу стоячих, ровных рек!
А зимних праздников блестящие тревоги?..
Но надо знать и честь; полгода снег да снег,
Ведь это наконец и жителю берлоги,
Медведю, надоест. Нельзя же целый век
Кататься нам в санях с Армидами младыми
Иль киснуть у печей за стеклами двойными"""
print(a)
# порахувати скільки слів у вірші (розбити по пробілу,  розбити по \n, len)
# знайти найдовше слово і вивести його (по пробілу, for дані записати в змінну)
# знайти найкоротше слово і  порахувати скільки разів воно зустрічається та вивести його (count)
# перевірити чи входить слово в вірш "люблю" (як з великої так і з малоъ літери), порашувати скільки разів воно зустріачється. (функція каунт у списках)
# висести всі слова які починаться на букву "с" (як велика так і мала) (використати список, щоб кожне слово яке знаходить додавалося у скисок функція апенд)
# 5 різних файлі та залити на git